translations = {
    'welcome': {
        'kaz': "🇰🇿 Қош келдіңіз! 🎉",
        'rus': "🇷🇺 Добро пожаловать! 🎉"
    },
    'start_prompt': {
        'kaz': "👋 Қош келдіңіз! / Добро пожаловать! 😊",
        'rus': "👋 Добро пожаловать! / Қош келдіңіз! 😊"
    },
    'choose_language': {
        'kaz': "🌐 Тілді таңдаңыз: / Выберите язык:",
        'rus': "🌐 Выберите язык: / Выберите язык:"
    },
    'enter_phone_number': {
        'kaz': "📞 Телефон нөміріңізді енгізіңіз: ✍️",
        'rus': "📞 Пожалуйста, введите свой номер телефона: ✍️"
    },
    'enter_your_fullname': {
        'kaz': "👤 Аты-жөніңізді енгізіңіз: ✍️",
        'rus': "👤 Пожалуйста, введите свое имя и фамилию: ✍️"
    },
    'already_started': {
        'kaz': "🚫 Сіз қазірдің өзінде бастадыңыз. Қайта бастау үшін /cancel басып, содан кейін /start жіберіңіз.",
        'rus': "🚫 Вы уже начали. Пожалуйста, нажмите /cancel и затем отправьте /start для перезапуска бота."
    },
    'cancel_message': {
        'kaz': "🚫 Әрекеттен бас тартылды. Сіз /start командасымен қайта бастай аласыз.",
        'rus': "🚫 Действие отменено. Вы можете перезапустить с помощью команды /start."
    },
    'choose_valid_language': {
        'kaz': "🗣 Қолданыстағы түймелерден қажетті тілді таңдаңыз!",
        'rus': "🗣 Выберите нужный вам язык из существующих кнопок!"
    },
    'usa': {
        'kaz': "🇺🇸 АҚШ",
        'rus': "🇺🇸 США"
    },
    'england': {
        'kaz': "🇬🇧 Англия",
        'rus': "🇬🇧 Англия"
    },
    'other_country': {
        'kaz': "🌍 Басқа",
        'rus': "🌍 Другое"
    },
    'enter_your_country': {
        'kaz': "🌍 Сіздің мемлекетіңізді енгізіңіз: ✍️",
        'rus': "🌍 Пожалуйста, введите свою страну: ✍️"
    },
    'select_country': {
        'kaz': "🌍 Оқуға түскіңіз келетін мемлекетті таңдаңыз:",
        'rus': "🌍 Выберите страну, в которую вы хотите поступить:"
    },
    'your_apply_complicated': {
        'kaz': "📝 Сіздің өтінішіңіз қабылданды. Өтінішіңізді тексеру үшін менеджердің жауап беруін күтіңіз."
               "Әліде сұрактарыңыз бар болса, виртуалды AI-ассистенттен сұраңыз.",
        'rus': "📝 Ваша заявка принята. Пожалуйста, дождитесь ответа менеджера для проверки вашей заявки."
               "Если у вас есть вопросы, обратитесь к виртуальному AI-ассистенту."
    },
    'client_exists': {
        'kaz': "🚫 Сіздің өтінішіңіз тіркелген. Өтінішіңізді тексеру үшін менеджердің жауап беруін күтіңіз."
               "Жаңа өтініш қалдырғыңыз келсе, /cancel басып, содан кейін /start жіберіңіз.",
        'rus': "🚫 Ваша заявка уже зарегистрирована. Пожалуйста, дождитесь ответа менеджера для проверки вашей заявки."
               "Если вы хотите оставить новую заявку, нажмите /cancel и затем отправьте /start."
    },
    'ask_from_assistant': {
        'kaz': "🤖 AI-ассистентпен сөйлесу",
        'rus': "🤖 Общение с AI-ассистентом"
    },
    'understand': {
        'kaz': "👍 Түсіндім",
        'rus': "👍 Понял"
    },
    'thanks_please_wait_answer': {
        'kaz': "🙏 Рахмет! Жауап күтіңіз.",
        'rus': "🙏 Спасибо! Пожалуйста, подождите ответа."
    },
    'ready_ask_any_questions': {
        'kaz': "Ассистентке сәтті қосылдыныз! Сұрауларыңызды жіберіңіз.",
        'rus': "Ассистент готов к общению! Отправьте свои вопросы."
    },
    'connenting_assistant': {
        'kaz': "Ассистентке қосылуда...",
        'rus': "Подключение к ассистенту..."
    },
    'error_occurred': {
        'kaz': "Қате пайда болды. Өтінеміз, кейінірек қайталап көріңіз.",
        'rus': "Произошла ошибка. Пожалуйста, попробуйте позже."
    },
    'enter_valid_fullname': {
        'kaz': "👤 Аты-жөніңізді дұрыс енгізіңіз, мысалы: Айдос Серік ✍️",
        'rus': "👤 Пожалуйста, введите правил свое имя и фамилию, например: Айдос Серик ✍️"
    },
    'enter_valid_phone_number': {
        'kaz': "📞 Телефон нөміріңізді дұрыс енгізіңіз, мысалы: 77057568891 ✍️",
        'rus': "📞 Пожалуйста, введите свой номер телефона правильно, например: 77057568891 ✍️"
    },
}

help_text_kaz = """
/help - 🤖 NBS Solutions Bot пайдалану бойынша нұсқаулық:

Бұл NBS Solutions компаниясының клиенттері үшін бот. Ол менеджерлердің жауаптарын, жақында аяқталған шарттарды, 
диалогтарды қабылдау үшін көрсетілген функцияларды ұсынады және де AI-ассистентпен сөйлесу мүмкіндігін береді.

Қол жетімді командалар:
- /start - Ботты бастау.
- /cancel - Шығу.
"""

help_text_rus = """
/help - 🤖 Руководство по использованию NBS Solutions Bot:

NBS Solutions — это бот для клиентов компании. Он предоставляет функции для приема ответов менеджеров, недавно
завершенных условий, приема диалогов и возможность общения с AI-ассистентом.

Доступные команды:
- /start - Запуск бота.
- /cancel - Выйти.
"""
